{
  "id": "70de6bac-589c-41c4-b611-a9a9940fb0b4",
  "siteName": "Nawiea Comms",
  "domainUrl": "nawieacomms.com",
  "brandingPresets": [
    {
      "presetId": "be4a38ff-7d6e-477c-9860-984f4f755fe7",
      "brandIdentity": {
        "designSummary": "This brand design features a modern, minimalistic aesthetic with a strong emphasis on high contrast and vibrant accent colors. The primary background is a soft off-white, providing a neutral and clean canvas that enhances readability and visual comfort. The primary brand color is a vivid neon green, used boldly in large blocks, buttons, and accent elements to inject energy and a futuristic feel. Black is employed extensively for text and some background blocks, creating sharp contrast and clear visual hierarchy. Typography is clean, geometric sans-serif, with large, bold headings and smaller body text that maintains clarity and approachability. The layout is modular and asymmetrical yet balanced, with generous negative space and rounded corners on content blocks to soften the overall look. Simple geometric icons and repeated radial/starburst motifs in black and gray reinforce brand identity without clutter. Buttons are minimalistic, using neon green or black backgrounds with clear outlines and text. Overall, the design communicates a confident, innovative, and tech-savvy brand personality, suitable for professional services or consultancies focused on growth and modern solutions.",
        "toneOfVoice": "Confident, innovative, professional, energetic, and approachable.",
        "tones": [
          "modern",
          "minimal",
          "bold",
          "energetic",
          "professional",
          "clean",
          "futuristic",
          "accessible",
          "tech-savvy",
          "confident"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modern",
            "Tech-Inspired"
          ],
          "supportingStyles": [
            "Geometric",
            "Modular",
            "High-Contrast"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#F9F9F9",
            "secondary": "#52FF00",
            "secondaryForeground": "#000000",
            "background": "#F9F9F9",
            "customColors": [
              {
                "name": "surfacealt",
                "value": "#F2F2F2"
              },
              {
                "name": "foreground",
                "value": "#000000"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the main canvas for pages and large sections to maintain a clean and neutral environment. The 'primary' color should be applied to key interactive elements such as buttons, call-to-actions, and highlighted content blocks to draw attention and convey energy. Text on 'primary' backgrounds should use 'primaryForeground' for maximum readability. The 'secondary' color is ideal for text, large headings, and background blocks that require strong contrast. When 'secondary' is used as a background, use 'secondaryForeground' for text to maintain legibility. The 'mediumGray' custom color is best suited for subtle UI elements like icons, borders, and secondary backgrounds to provide depth without overpowering the primary palette. Combining 'primary' and 'secondary' colors in adjacent blocks creates a dynamic visual rhythm, while ample negative space ensures the design remains uncluttered and accessible.",
          "paletteAccessibilityNotes": "The 'primaryForeground' on 'primary' background and 'secondaryForeground' on 'secondary' background combinations meet WCAG AA standards for text contrast, ensuring readability for users with visual impairments. The 'mediumGray' on 'background' also provides sufficient contrast for icons and secondary text. The high contrast between 'secondary' and 'background' supports clear hierarchy and focus. Care should be taken when using 'primary' on 'background' for smaller text to maintain legibility, preferably using it for larger text or UI elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "avenir-lt-w01_85-heavy1475544",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "futura-lt-w01-book",
              "proxima-n-w01-reg",
              "montserrat"
            ],
            "headingsUsageGuide": "Use the heading font for all primary titles and section headers to establish clear visual hierarchy. Headings should be large and bold, contrasting strongly with body text. Pair headings with the paragraph font to maintain readability and balance. Maintain consistent spacing above and below headings to separate content blocks effectively. Use 'secondary' color for headings on light backgrounds and 'primary' color for headings on dark backgrounds to ensure accessibility.",
            "headingsAccessibilityNotes": "Headings in 'secondary' color on 'background' and in 'primary' color on 'secondary' background meet WCAG AA contrast requirements, ensuring clear readability for all users."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "avenir-lt-w01_35-light1475496",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "open sans",
              "rubik-v2",
              "work-sans-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and secondary information. Maintain sufficient line height and letter spacing for readability. Paragraph text should primarily use 'secondary' color on 'background' for clarity. When placed on 'primary' or 'secondary' backgrounds, use the corresponding foreground colors to maintain contrast. Avoid using paragraph text in 'primary' color on 'background' for small sizes to ensure legibility.",
            "paragraphsAccessibilityNotes": "Paragraph text colors on their respective backgrounds meet WCAG AA standards for contrast, supporting accessibility for users with visual impairments."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section places large, bold headings anchored in the top third of the viewport, creating immediate impact and focus. The heading text is left-aligned with generous negative space around it, allowing the message to breathe and stand out. Supporting text and call-to-action buttons are positioned below the heading in smaller font sizes, maintaining a clear visual hierarchy. The use of bright neon green blocks adjacent to the text anchors the composition and adds vibrancy, while the overall layout remains balanced and uncluttered."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "300"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "300"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.035em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.035em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "0.04em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.04em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "Flexible 12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within content blocks"
          }
        },
        "components": {
          "containers": "Containers use rounded corners with solid fills in 'primary', 'secondary', or 'background' colors. They maintain consistent padding and spacing to separate content clearly. The use of color blocks helps differentiate sections and guide user focus.",
          "images": "Images are presented in grayscale or muted tones to avoid clashing with the vibrant color palette. They are cropped with rounded corners to match container styles and maintain visual harmony.",
          "buttons": "Buttons are either filled with 'primary' color with 'primaryForeground' text or outlined with 'primary' color on 'background'. Secondary buttons use 'secondary' color backgrounds with 'secondaryForeground' text. Buttons have rounded corners and consistent padding for a modern, approachable feel."
        },
        "graphicElements": {
          "icons": "Icons are simple, geometric, and monochromatic, primarily using 'mediumGray' or 'secondary' colors. They complement the minimalistic style without distracting from content.",
          "illustrations": "No prominent illustrations are used; the design relies on geometric shapes and icons for visual interest.",
          "stickers": "Stickers or badges use the 'primary' neon green color with black iconography or text, maintaining brand consistency and high visibility."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752397427100-Screenshot%202025-07-13%20at%2012.02.34.png"
      ]
    },
    {
      "presetId": "e3803693-24c3-4139-8260-016899e16953",
      "brandIdentity": {
        "designSummary": "This brand design embraces a minimalistic and modern editorial style, characterized by a restrained and professional color palette dominated by soft neutrals and muted pastels. The primary background is a very light grayish-white, complemented by subtle light blue content blocks that create visual separation without overwhelming the user. Typography is elegant and classic, featuring serif fonts for headings that convey sophistication and trustworthiness, paired with clean, readable serif or serif-inspired body text. The layout employs a balanced two-column grid with generous white space, ensuring clarity and ease of navigation. Abstract geometric dot-matrix style graphics subtly reinforce the AI and technology theme, integrated as understated visual motifs. UI elements such as navigation and buttons are minimal and refined, using thin lines and subtle contrasts to maintain the airy and professional aesthetic. Overall, the design communicates a calm, authoritative, and approachable tone suitable for professional consulting and technology sectors.",
        "toneOfVoice": "Professional, calm, authoritative, and approachable with a sophisticated and trustworthy personality.",
        "tones": [
          "calm",
          "professional",
          "trustworthy",
          "minimal",
          "sophisticated",
          "approachable",
          "clean",
          "modern",
          "refined",
          "balanced"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Editorial"
          ],
          "supportingStyles": [
            "Modern",
            "Tech-Inspired"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#B9D6E8",
            "primaryForeground": "#333333",
            "secondary": "#F9FAFB",
            "secondaryForeground": "#333333",
            "background": "#FFFFFF",
            "customColors": [
              {
                "name": "darktext",
                "value": "#333333"
              },
              {
                "name": "buttonborder",
                "value": "#333333"
              },
              {
                "name": "contentblockbackground",
                "value": "#E6F0F6"
              },
              {
                "name": "foreground",
                "value": "#333333"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the main page canvas to maintain a clean and open feel. The 'secondary' color is ideal for large content blocks or sections to create subtle visual separation without heavy contrast. The 'primary' color should be used for accent backgrounds or highlight areas, such as side panels or feature blocks, to add calm emphasis. Text should primarily use 'darkText' for maximum readability on all backgrounds. Buttons and interactive elements should use 'buttonBorder' for outlines and text to maintain a minimal and refined look. The 'contentBlockBackground' can be used for subtle backgrounds behind text or graphics to enhance hierarchy and focus. Combining 'primary' with 'primaryForeground' ensures accessible contrast for headings or callouts, while 'secondary' with 'secondaryForeground' supports body text and secondary content. Overall, colors are balanced to maintain a professional and approachable atmosphere with sufficient contrast for accessibility.",
          "paletteAccessibilityNotes": "The 'primary' color paired with 'primaryForeground' meets WCAG AA standards for large text and UI elements, ensuring readability and accessibility. The 'secondary' color with 'secondaryForeground' also meets WCAG AA contrast ratios for body text and secondary content. The 'darkText' color on 'background' and 'secondary' backgrounds provides strong contrast for all text elements. Button borders and text using 'buttonBorder' on 'secondary' or 'background' maintain clear visibility and interactive affordance. Overall, the palette supports accessible typography and UI components across the site."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "raleway"
            ],
            "headingsUsageGuide": "Use the 'bitter' font for all primary headings to establish a clear hierarchy and refined tone. Headings should be sized prominently with ample line height and letter spacing to enhance readability and elegance. Pair headings with body text fonts that complement serif styles to maintain visual harmony. Use the 'primary' or 'darkText' colors for headings to ensure strong contrast against backgrounds. Avoid overly tight letter spacing to preserve the font's classic character. Headings can be spaced generously from body text to create a balanced and airy layout.",
            "headingsAccessibilityNotes": "Headings in 'bitter' font with 'primaryForeground' or 'darkText' colors on 'primary' or 'background' colors meet WCAG AA contrast standards for all sizes, ensuring clear readability and accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "madefor-display",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "raleway",
              "playfair display",
              "cormorantgaramond"
            ],
            "paragraphsUsageGuide": "Use the 'bitter' font for body text to maintain consistency and a professional appearance. Body text should be sized for comfortable reading with appropriate line height and letter spacing. Use 'darkText' or 'primaryForeground' colors for body text on 'secondary' or 'background' colors to ensure legibility. Maintain sufficient spacing between paragraphs and other elements to avoid clutter. Pair body text with serif headings for a cohesive editorial style. Avoid using body text in all caps or overly decorative styles to preserve clarity.",
            "paragraphsAccessibilityNotes": "Body text in 'bitter' font with 'darkText' or 'primaryForeground' colors on 'secondary' or 'background' colors meets WCAG AA contrast requirements for normal and large text, supporting accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a weighted quadrant layout where the left quadrant is dedicated to large, bold heading text aligned top-left, creating a strong visual anchor. The right quadrant features an abstract geometric graphic that balances the composition. This asymmetrical but balanced placement draws the eye naturally from text to image, emphasizing the message while maintaining visual interest. Generous white space surrounds the elements, enhancing clarity and focus. Typography here is large and prominent, using the 'bitter' font for headings with ample line height and letter spacing to convey authority and sophistication."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.25",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.35",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.015em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.015em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.02em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.025em",
              "fontWeight": "800"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.03em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.035em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Two-column grid with alternating content blocks",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use subtle background color blocks such as 'primary' and 'secondary' to visually separate content areas. They maintain generous padding and margin to ensure content clarity and breathing room. Borders are minimal or absent, relying on color contrast for separation.",
          "images": "Images or graphics are treated as abstract geometric dot-matrix style shapes with monochromatic or muted pastel colors. They integrate seamlessly into the layout as side or background elements, maintaining the minimal and professional aesthetic.",
          "buttons": "Buttons are minimal with thin borders using 'buttonBorder' color and transparent backgrounds. Text inside buttons uses 'darkText' for readability. Hover states may invert colors subtly or increase border weight to indicate interactivity without disrupting the clean design."
        },
        "graphicElements": {
          "icons": "Icons are minimal line-based designs in 'darkText' or 'buttonBorder' colors, consistent with the overall minimal and professional style.",
          "illustrations": "Illustrations are abstract, geometric, and pixelated or dot-matrix style, using monochromatic or muted pastel colors to reinforce the AI and technology theme subtly.",
          "stickers": "No stickers or badges are present; the design avoids decorative elements to maintain a clean and professional look."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752391231198-Screenshot%202025-07-13%20at%209.59.22.png"
      ]
    },
    {
      "presetId": "65754585-e9c5-4442-a4a7-69fe75686f20",
      "brandIdentity": {
        "designSummary": "This brand design embodies a modern, minimalist, and technology-driven aesthetic. It employs a stark color palette dominated by black and white backgrounds, contrasted sharply with a vivid orange accent color used for interactive elements such as links, buttons, and highlights. The typography is monospace, evoking a technical and precise tone, with consistent left alignment and generous spacing to enhance readability. The layout is grid-based and modular, featuring spacious margins and padding that create a clean and uncluttered user experience. Graphic elements include wireframe 3D geometric shapes rendered in white on black backgrounds, reinforcing a futuristic and innovative brand personality. Calls to action are styled with code-like syntax using curly braces and arrows, further emphasizing the brand's tech-savvy identity. Overall, the design communicates professionalism, innovation, and expertise in IT and technology sectors, making it versatile for various modern business applications.",
        "toneOfVoice": "Professional, innovative, precise, and tech-savvy with a clear and confident communication style.",
        "tones": [
          "Minimal",
          "Futuristic",
          "Technical",
          "Clean",
          "Innovative",
          "Professional",
          "Bold",
          "Structured",
          "Sophisticated",
          "Focused"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Techno-Futuristic",
            "Monospace Typography"
          ],
          "supportingStyles": [
            "Grid-Based Layout",
            "Wireframe Graphics",
            "Modular Design"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#D8400E",
            "primaryForeground": "#FFFFFF",
            "secondary": "#000000",
            "secondaryForeground": "#FFFFFF",
            "background": "#FFFFFF",
            "customColors": [
              {
                "name": "darkbackground",
                "value": "#000000"
              },
              {
                "name": "textprimary",
                "value": "#000000"
              },
              {
                "name": "textsecondary",
                "value": "#D8400E"
              },
              {
                "name": "forgrounde",
                "value": "#000000"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color for all interactive elements such as buttons, links, and highlights to draw user attention and reinforce brand identity. The 'primaryForeground' color should be used for text or icons placed on 'primary' backgrounds to ensure readability. The 'secondary' color serves as the main background for dark-themed sections, with 'secondaryForeground' used for text and icons on these dark backgrounds. The 'background' color is the default page background for light-themed sections, with 'textPrimary' used for body text and headings on this background. The 'darkBackground' and 'textSecondary' colors are used for high-contrast dark mode or section backgrounds and their corresponding text. This palette ensures strong contrast and accessibility while maintaining a clean and modern aesthetic. Colors should be combined thoughtfully to maintain readability and visual hierarchy, with 'primary' reserved for calls to action and emphasis, and 'secondary' and 'background' providing structural balance.",
          "paletteAccessibilityNotes": "The combination of 'primary' (#D94A1B) on 'primaryForeground' (#FFFFFF) meets WCAG AA standards for text and interactive elements, ensuring sufficient contrast. The 'secondary' (#000000) background with 'secondaryForeground' (#FFFFFF) text provides excellent contrast exceeding WCAG AAA standards. The 'background' (#FFFFFF) with 'textPrimary' (#000000) also meets WCAG AAA contrast requirements for body text. This palette supports accessibility best practices across light and dark sections, ensuring legibility and user comfort."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "space grotesk",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "roboto",
              "space grotesk",
              "quicksand"
            ],
            "headingsUsageGuide": "Use the 'azeret-mono' font for all headings to maintain a consistent technical and modern tone. Headings should be left-aligned with ample spacing above and below to create clear separation from body text. Pair headings with paragraph text of the same or complementary monospace fonts to preserve visual harmony. Use the 'primary' color for headings on light backgrounds and 'secondaryForeground' on dark backgrounds to ensure readability and emphasis. Avoid overly large font sizes that disrupt the minimalist layout; maintain a balanced hierarchy with clear differentiation from body text.",
            "headingsAccessibilityNotes": "Headings in 'azeret-mono' combined with 'primary' or 'secondaryForeground' colors meet WCAG AA contrast standards, ensuring clear readability and accessibility for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "azeret-mono",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "roboto",
              "space grotesk",
              "quicksand"
            ],
            "paragraphsUsageGuide": "Use the 'azeret-mono' font for body text to maintain consistency with headings and reinforce the technical brand identity. Text should be left-aligned with sufficient line height and letter spacing to enhance readability. On light backgrounds, use 'textPrimary' color, and on dark backgrounds, use 'textSecondary'. Maintain a clear visual hierarchy by using smaller font sizes than headings and avoiding dense blocks of text. Incorporate code-like syntax styling for calls to action or special text elements using the 'primary' color to emphasize interactivity.",
            "paragraphsAccessibilityNotes": "Body text in 'azeret-mono' with 'textPrimary' on 'background' or 'textSecondary' on 'darkBackground' meets WCAG AA contrast requirements, supporting accessibility and user comfort."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a weighted quadrant layout where the left half is dedicated to textual content aligned left, and the right half features a large visual or graphic element. Typography is placed in the lower-left quadrant, creating a balanced and focused entry point. The text uses monospace font with clear hierarchy, and the call-to-action is styled with code-like brackets in the 'primary' color, reinforcing the tech theme. This placement ensures immediate user focus on the message while maintaining visual interest with the adjacent graphic."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.05em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.04em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.01em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.6",
              "letterSpacing": "0em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.4",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.03em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers are defined with clear boundaries and consistent padding, using either white or black backgrounds to create distinct sections. They maintain a minimalist style with no excessive decoration, relying on color contrast and spacing to separate content areas. The 'darkBackground' container style is used for service sections, while 'background' containers are used for introductory and informational content.",
          "images": "Images and graphics are treated as focal points within their containers, often occupying half or full container width. Wireframe 3D shapes are used as illustrative elements, rendered in white lines on black backgrounds to maintain the tech aesthetic. Images are clean, with no borders or shadows, emphasizing clarity and modernity.",
          "buttons": "Buttons are styled minimally, often as text links or outlined boxes in the 'primary' color. They use monospace font with code-like syntax (curly braces and arrows) to reinforce the brand's technical identity. Buttons have no heavy backgrounds or gradients, maintaining the minimalist and high-contrast design."
        },
        "graphicElements": {
          "icons": "Icons are minimal and line-based, consistent with the wireframe style. They use the 'primary' color for emphasis and are simple in form to maintain clarity and modernity.",
          "illustrations": "Illustrations consist primarily of 3D wireframe geometric shapes rendered in white on black backgrounds. These shapes convey complexity and innovation without overwhelming the design, supporting the futuristic and technical brand personality.",
          "stickers": "No stickers or badge-style elements are present, maintaining the clean and minimal aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750170708963-Screenshot%202025-06-05%20at%2015.50.53.png"
      ]
    },
    {
      "presetId": "0dcb068f-c67e-4584-9159-c11e15718388",
      "brandIdentity": {
        "designSummary": "This design features a modern, high-contrast aesthetic with a minimalistic yet bold approach. The primary color palette revolves around a vivid orange accent paired with deep charcoal black and clean white backgrounds, creating a dynamic and professional atmosphere. Typography is geometric and sans-serif, emphasizing clarity and technical sophistication. The layout is grid-based and modular, with generous spacing and clear hierarchical numbering to guide users through content logically. UI components such as buttons and cards are minimalistic with subtle shadows and rounded corners, reinforcing a sleek and contemporary feel. The overall visual personality is that of a cutting-edge technology brand, conveying trustworthiness, innovation, and expertise.",
        "toneOfVoice": "Authoritative, innovative, and professional with a focus on precision and clarity.",
        "tones": [
          "Professional",
          "Innovative",
          "Bold",
          "Technical",
          "Clean",
          "Authoritative",
          "Dynamic",
          "Precise",
          "Modern",
          "Minimalistic"
        ],
        "designStyle": {
          "primaryStyle": [
            "Modern",
            "Minimalism",
            "Tech-Industrial"
          ],
          "supportingStyles": [
            "Modular",
            "High-Contrast",
            "Corporate"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#D23F0F",
            "primaryForeground": "#FFFFFF",
            "secondary": "#121212",
            "secondaryForeground": "#FFFFFF",
            "background": "#FAFAFA",
            "customColors": [
              {
                "name": "foreground",
                "value": "#111111"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              },
              {
                "name": "surfacedark",
                "value": "#1C1C1C"
              },
              {
                "name": "divider",
                "value": "#E0E0E0"
              }
            ]
          },
          "paletteUsageGuide": "The color system is defined by a stark contrast between the 'background' and the 'secondary' color. Use the 'secondary' color to create immersive, full-width sections that house technical capabilities or feature lists, using 'secondaryForeground' for all typography within these zones. The 'background' color serves as the canvas for standard content, research data, and card-based layouts, paired with the 'foreground' color for text. The 'primary' color is the brand's 'safety signal'; use it exclusively for high-impact visual anchors such as numbered badges, active navigation states, or primary call-to-action buttons. Do not overuse the 'primary' color for large backgrounds. Use 'surfaceDark' for container elements that sit on top of the 'secondary' background to create subtle depth. The 'divider' color should be used for the thin, precise horizontal lines that structure the content.",
          "paletteAccessibilityNotes": "The combination of 'background' and 'foreground' provides excellent contrast (AAA). Similarly, 'secondary' and 'secondaryForeground' offer high contrast suitable for all text sizes. The 'primary' color with 'primaryForeground' generally meets minimum contrast requirements for large text or graphical UI components (like the numbered badges shown) but may fall short of WCAG AA for small body text; therefore, avoid using 'primary' as a background for fine print. Ensure that any text placed on 'surfaceDark' maintains sufficient lightness to stand out."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "Sora",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "work-sans-v2",
              "poppins-v2",
              "raleway"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to establish hierarchy and clarity. Headings should be bold and sized prominently to contrast with body text. Pair headings with the paragraph font to maintain a cohesive and professional look. Adequate spacing above and below headings ensures readability and visual separation. Use the 'primary' color for numbering and accent elements near headings to reinforce brand identity.",
            "headingsAccessibilityNotes": "Headings use high contrast colors such as 'secondaryForeground' on 'secondary' backgrounds or black on 'background' to meet WCAG AA standards for large text, ensuring clear readability."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "Sora",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "work-sans-v2",
              "open sans",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and smaller informational content. Maintain sufficient line height and letter spacing for comfortable reading. Paragraph text should contrast strongly with the background, using 'secondaryForeground' on dark backgrounds and black or dark gray on light backgrounds. Avoid using the 'primary' color for large blocks of text to preserve readability and focus the accent color on interactive or key elements.",
            "paragraphsAccessibilityNotes": "Paragraph text colors maintain WCAG AA contrast ratios against their backgrounds, ensuring accessibility for all users."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section uses a large, bold heading anchored in the top third of the viewport, overlaying a full-width hero image. The heading is left-aligned with ample padding, creating a strong focal point. Supporting text is placed nearby with smaller font size and lighter weight, maintaining hierarchy. The placement balances visual impact with readability, leveraging negative space around the text to avoid clutter and emphasize the brand message."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.07em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid backgrounds of either 'background' or 'secondary' colors with subtle shadows and rounded corners to create separation and depth. Content is well padded and spaced to maintain clarity and hierarchy. Number badges in 'primary' color are used to label sections and items, adding visual interest and aiding navigation.",
          "images": "Images are used prominently in hero sections with full-width layouts and overlay text. They are industrial and technical in tone but do not influence the core color palette. Images have no borders and are integrated seamlessly into the layout.",
          "buttons": "Buttons are minimalistic with a solid 'primary' background and 'primaryForeground' text for primary actions. Secondary buttons use transparent backgrounds with 'primary' colored borders and text. Buttons have subtle rounded corners and consistent padding, maintaining a clean and modern look."
        },
        "graphicElements": {
          "icons": "Icons are simple, line-based, and use the 'primary' color for emphasis. They maintain a consistent stroke weight and style, supporting the technical and modern aesthetic.",
          "illustrations": "No illustrations are present; the design relies on photography and clean UI elements.",
          "stickers": "Number badges and small labels use the 'primary' color with white text, featuring rounded corners and consistent sizing to create a cohesive visual language."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752412000140-Screenshot%202025-06-04%20at%2011.01.34.jpg"
      ]
    }
  ],
  "brandBook": {
    "tones": [
      "modern",
      "minimal",
      "bold",
      "energetic",
      "professional",
      "clean",
      "futuristic",
      "accessible",
      "tech-savvy",
      "confident"
    ],
    "designStyle": {
      "primaryStyle": [
        "Minimalism",
        "Modern",
        "Tech-Inspired"
      ],
      "supportingStyles": [
        "Geometric",
        "Modular",
        "High-Contrast"
      ]
    },
    "toneOfVoice": "Confident, innovative, professional, energetic, and approachable.",
    "components": {
      "images": "Images are presented in grayscale or muted tones to avoid clashing with the vibrant color palette. They are cropped with rounded corners to match container styles and maintain visual harmony.",
      "buttons": "Buttons are either filled with 'primary' color with 'primaryForeground' text or outlined with 'primary' color on 'background'. Secondary buttons use 'secondary' color backgrounds with 'secondaryForeground' text. Buttons have rounded corners and consistent padding for a modern, approachable feel.",
      "containers": "Containers use rounded corners with solid fills in 'primary', 'secondary', or 'background' colors. They maintain consistent padding and spacing to separate content clearly. The use of color blocks helps differentiate sections and guide user focus."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "Primary Heading Font",
          "fontFamily": "avenir-lt-w01_85-heavy1475544",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use the heading font for all primary titles and section headers to establish clear visual hierarchy. Headings should be large and bold, contrasting strongly with body text. Pair headings with the paragraph font to maintain readability and balance. Maintain consistent spacing above and below headings to separate content blocks effectively. Use 'secondary' color for headings on light backgrounds and 'primary' color for headings on dark backgrounds to ensure accessibility.",
        "headingsSimilarFonts": [
          "futura-lt-w01-book",
          "proxima-n-w01-reg",
          "montserrat"
        ],
        "headingsAccessibilityNotes": "Headings in 'secondary' color on 'background' and in 'primary' color on 'secondary' background meet WCAG AA contrast requirements, ensuring clear readability for all users."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.2",
          "fontWeight": "300"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "300"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "600"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.4",
          "fontWeight": "600"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.3",
          "fontWeight": "700"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.2",
          "fontWeight": "700"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "0.035em",
          "lineHeight": "1.1",
          "fontWeight": "800"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "0.035em",
          "lineHeight": "1.1",
          "fontWeight": "800"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "0.05em",
          "lineHeight": "1",
          "fontWeight": "900"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "Main Body Text Font",
          "fontFamily": "avenir-lt-w01_35-light1475496",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and secondary information. Maintain sufficient line height and letter spacing for readability. Paragraph text should primarily use 'secondary' color on 'background' for clarity. When placed on 'primary' or 'secondary' backgrounds, use the corresponding foreground colors to maintain contrast. Avoid using paragraph text in 'primary' color on 'background' for small sizes to ensure legibility.",
        "paragraphsSimilarFonts": [
          "open sans",
          "rubik-v2",
          "work-sans-v2"
        ],
        "paragraphsAccessibilityNotes": "Paragraph text colors on their respective backgrounds meet WCAG AA standards for contrast, supporting accessibility for users with visual impairments."
      },
      "welcomeSectionTypography": {
        "placement": "Top-Third Anchor",
        "implementation": "The welcome section places large, bold headings anchored in the top third of the viewport, creating immediate impact and focus. The heading text is left-aligned with generous negative space around it, allowing the message to breathe and stand out. Supporting text and call-to-action buttons are positioned below the heading in smaller font sizes, maintaining a clear visual hierarchy. The use of bright neon green blocks adjacent to the text anchors the composition and adds vibrancy, while the overall layout remains balanced and uncluttered."
      }
    },
    "originImagesUrls": [
      "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752397427100-Screenshot%202025-07-13%20at%2012.02.34.png"
    ],
    "layout": {
      "grid": {
        "margins": "Generous page margins",
        "padding": "Consistent padding within content blocks",
        "spacing": {
          "gaps": "Consistent medium gaps",
          "rows": "Defined content rows",
          "columns": "Flexible 12-column grid"
        },
        "compositionApproach": "Modular"
      },
      "layoutDna": {
        "contrastSpectrum": "High-Contrast",
        "densitySpectrum": "Balanced",
        "textVsImageEmphasis": "Balanced",
        "complexitySpectrum": "Simple & Clean",
        "gridAlignmentSpectrum": "Modular",
        "negativeSpaceUsage": "Generous"
      }
    },
    "graphicElements": {
      "icons": "Icons are simple, geometric, and monochromatic, primarily using 'mediumGray' or 'secondary' colors. They complement the minimalistic style without distracting from content.",
      "stickers": "Stickers or badges use the 'primary' neon green color with black iconography or text, maintaining brand consistency and high visibility.",
      "illustrations": "No prominent illustrations are used; the design relies on geometric shapes and icons for visual interest."
    },
    "designSummary": "This brand design features a modern, minimalistic aesthetic with a strong emphasis on high contrast and vibrant accent colors. The primary background is a soft off-white, providing a neutral and clean canvas that enhances readability and visual comfort. The primary brand color is a vivid neon green, used boldly in large blocks, buttons, and accent elements to inject energy and a futuristic feel. Black is employed extensively for text and some background blocks, creating sharp contrast and clear visual hierarchy. Typography is clean, geometric sans-serif, with large, bold headings and smaller body text that maintains clarity and approachability. The layout is modular and asymmetrical yet balanced, with generous negative space and rounded corners on content blocks to soften the overall look. Simple geometric icons and repeated radial/starburst motifs in black and gray reinforce brand identity without clutter. Buttons are minimalistic, using neon green or black backgrounds with clear outlines and text. Overall, the design communicates a confident, innovative, and tech-savvy brand personality, suitable for professional services or consultancies focused on growth and modern solutions.",
    "palette": {
      "colors": {
        "background": "#F9F9F9",
        "secondary": "#52FF00",
        "customColors": [
          {
            "name": "surfacealt",
            "value": "#F2F2F2"
          },
          {
            "name": "foreground",
            "value": "#000000"
          },
          {
            "name": "destructive",
            "value": "#DF3131"
          }
        ],
        "secondaryForeground": "#000000",
        "primaryForeground": "#F9F9F9",
        "primary": "#000000"
      },
      "paletteUsageGuide": "Use the 'background' color as the main canvas for pages and large sections to maintain a clean and neutral environment. The 'primary' color should be applied to key interactive elements such as buttons, call-to-actions, and highlighted content blocks to draw attention and convey energy. Text on 'primary' backgrounds should use 'primaryForeground' for maximum readability. The 'secondary' color is ideal for text, large headings, and background blocks that require strong contrast. When 'secondary' is used as a background, use 'secondaryForeground' for text to maintain legibility. The 'mediumGray' custom color is best suited for subtle UI elements like icons, borders, and secondary backgrounds to provide depth without overpowering the primary palette. Combining 'primary' and 'secondary' colors in adjacent blocks creates a dynamic visual rhythm, while ample negative space ensures the design remains uncluttered and accessible.",
      "paletteAccessibilityNotes": "The 'primaryForeground' on 'primary' background and 'secondaryForeground' on 'secondary' background combinations meet WCAG AA standards for text contrast, ensuring readability for users with visual impairments. The 'mediumGray' on 'background' also provides sufficient contrast for icons and secondary text. The high contrast between 'secondary' and 'background' supports clear hierarchy and focus. Care should be taken when using 'primary' on 'background' for smaller text to maintain legibility, preferably using it for larger text or UI elements."
    }
  },
  "initialPrompt": "Design a website for Ettisalat Nawiea Company with 6 pages: 1) Main page with a carousel, info about current projects, future plans, services provided in the network, and a map picture of Libya. 2) Info about Tetra technology. 3) About page with company info. 4) Devices page listing radio devices provided by the company. 5) Jobs page (currently no jobs available). 6) Contact us page.",
  "status": "READY",
  "revision": "11",
  "createdDate": "2025-12-02T17:26:43.504Z",
  "updatedDate": "2025-12-02T17:27:04.070Z",
  "attachments": {
    "contentImagesUrls": [],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "be4a38ff-7d6e-477c-9860-984f4f755fe7",
  "plan": "{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This plan outlines a website for Ettisalat Nawiea Company, featuring information about projects, services, technology, company details, radio devices, and contact information.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **View Homepage Content**: Displays a carousel, information on current projects, future plans, network services, and a map of Libya.\\n- **View Project Listing**: Shows a list of current projects.\\n- **View Project Details**: Displays detailed information for a specific project.\\n- **View Future Plans Information**: Provides information about the company's future plans.\\n- **View Services Information**: Details the services provided by the company within the network.\\n- **View Libya Map**: Displays a map image of Libya.\\n- **View Tetra Technology Information**: Presents information about Tetra technology.\\n- **View Company Information**: Offers general information about the company.\\n- **View Device Listing**: Lists the radio devices provided by the company.\\n- **Filter Devices**: Allows filtering the list of radio devices.\\n- **View Device Details**: Shows detailed information for a specific radio device.\\n- **View Job Listing**: Displays available job openings (currently none).\\n- **Submit Contact Form**: Allows visitors to send inquiries through a contact form.\",\n      \"metadata\": [\n        { \"id\": \"view-homepage-content\", \"name\": \"View Homepage Content\" },\n        { \"id\": \"view-project-listing\", \"name\": \"View Project Listing\" },\n        { \"id\": \"view-project-details\", \"name\": \"View Project Details\" },\n        { \"id\": \"view-future-plans-information\", \"name\": \"View Future Plans Information\" },\n        { \"id\": \"view-services-information\", \"name\": \"View Services Information\" },\n        { \"id\": \"view-libya-map\", \"name\": \"View Libya Map\" },\n        { \"id\": \"view-tetra-technology-information\", \"name\": \"View Tetra Technology Information\" },\n        { \"id\": \"view-company-information\", \"name\": \"View Company Information\" },\n        { \"id\": \"view-device-listing\", \"name\": \"View Device Listing\" },\n        { \"id\": \"filter-devices\", \"name\": \"Filter Devices\" },\n        { \"id\": \"view-device-details\", \"name\": \"View Device Details\" },\n        { \"id\": \"view-job-listing\", \"name\": \"View Job Listing\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" }\n      ]\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Homepage**: Hosts the main page content, including project highlights, future plans, services, and the Libya map.\\n- **Tetra Technology Page**: Displays information about Tetra technology.\\n- **About Us Page**: Contains company information.\\n- **Devices Page**: Lists and allows filtering of radio devices.\\n- **Jobs Page**: Shows current job openings.\\n- **Contact Us Page**: Features the contact form.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"view-homepage-content\", \"name\": \"View Homepage Content\" },\n        { \"id\": \"view-project-listing\", \"name\": \"View Project Listing\" },\n        { \"id\": \"view-project-details\", \"name\": \"View Project Details\" },\n        { \"id\": \"view-future-plans-information\", \"name\": \"View Future Plans Information\" },\n        { \"id\": \"view-services-information\", \"name\": \"View Services Information\" },\n        { \"id\": \"view-libya-map\", \"name\": \"View Libya Map\" },\n        { \"id\": \"view-tetra-technology-information\", \"name\": \"View Tetra Technology Information\" },\n        { \"id\": \"view-company-information\", \"name\": \"View Company Information\" },\n        { \"id\": \"view-device-listing\", \"name\": \"View Device Listing\" },\n        { \"id\": \"filter-devices\", \"name\": \"Filter Devices\" },\n        { \"id\": \"view-device-details\", \"name\": \"View Device Details\" },\n        { \"id\": \"view-job-listing\", \"name\": \"View Job Listing\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" }\n      ]\n    }\n  ],\n  \"version\": \"2.5\"\n}",
  "designerData": {
    "designerId": "59076a1d-61da-4711-8035-592d26c5d5fe",
    "designerName": "Linus",
    "selectionMethod": "UNSELECTED"
  }
}